# SpotDimStyleSlopeUnits Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..SpotDimStyleSlopeUnits Property
ParameterTypeId Class See Also
---
"Units Format"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId SpotDimStyleSlopeUnits { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property SpotDimStyleSlopeUnits As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ SpotDimStyleSlopeUnits {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace